function [E,Z,M] = gdlog(I,s)
%Η συνάρτηση αυτή δέχεται ως ορίσματα μια εικόνα εισόδου Ι και υπολογίζει
%το μέτρο Μ που αντισοιχεί στο φιλτράρισμα αυτής με 2D Gaussian Derivative
%οπου η Gaussian εχει τυπικη απόκιση s, και τα zero crossings Z μετα απο
%φιλτράρισμα με την Laplacian ofGaussian. Στη συνέχεια στον πίνακα Ε
%εξάγονται οι ακμές της αρχικής εικόνας.

%********* Δημιουργια γκαουσιανης και της παραγωγου της *******************
K = 31;                                           %μεγεθος φιλτρου
vk = (0:K-1)-(K-1)/2;                             %αξονες για gaussian
[u,v] = meshgrid(vk,vk);                          %δημιουργια του πλεγματος
G = 1 / (2*pi*s^2) * exp(-(u.^2+v.^2) / (2*s^2)); %δημιουργια gaussian
Gu = -(u/s^2) .* G;                               %παράγωγος κατα u
Gv = -(v/s^2) .* G;                               %παράγωγος κατα v
%**************************************************************************


%****** Φιλτάρισμα εικόνας με την 2D παράγωγο της gaussian*****************
%********** και υπολογισμός του μέτρου του αποτελέσματος ******************
Gx = imfilter(I, Gu, 'replicate', 'conv');        %φιλτράρισμα κατα x
Gy = imfilter(I, Gv, 'replicate', 'conv');        %φιλτράρισμα κατα y
M = sqrt(Gx.^2 + Gy.^2);                          %υπολογισμός μέτρου
%**************************************************************************


%********* Φιλτράρισμα εικόνας με την Laplacian of Gaussian ***************
%*************** και υπολογισμός των zero crossings ***********************
L = fspecial('log', K, s);                       %δημιουργια φίλτρου
Z = imfilter(I, L, 'replicate');                 %φιλτράρισμα με LoG
Z = double(bwperim(Z>=0));                       %zero crossings
%**************************************************************************


%****** Υπολογισμος ακμών απο πολλπαπλασιασμό πινάκων Μ και Ζ *************
E = Z.*M;                               %Ε πίνακας Εdges
%E = double(E>=(max(E(:))/10));         %uncomment αν θελετε κατωφλιοποίηση των ακμών
%**************************************************************************



end








