function [ SNR_0, SNR_G, SNR_S ] = denoise( I,s )
%Η συναρτηση αυτη δεχεται σαν εισοδο μια εικονα Ι και μια παραμετρο s. Στη 
%συνεχεια θορυβοποιει τη εικονα με γκαουσιανο θορυβο τυπικης αποκλισης s
%και την φιλτραρει με ενα γκαουσιανο φιλτρο καθως και με ενα βαθυπερατο.
%Στην εξοδο μας δινει τον σηματοθορυβικο λογο εικονας προς θορυβοποιημενη
%(SNR_0), τον σηματοθορυβικο λογο εικονας προς φιλτραρισμενη με γκαουσιανο
%φιλτρο (SNR_G), και τον σηματοθορυβικο λογο εικονας προς φιλτραρισμανη με
%βαθυπερατο φιλτρο (SNR_S).


%θοορυβοποιηση της εικονας με γκαουσιανο θορυβο
N = imnoise(I,'gaussian',0,s^2);

%δημιουργια γκαουσιανου φιλτρου
g = fspecial('gaussian',[11 11],2);

%δημιουργια βαθυπερατου φιλτρου
[f1,f2] = freqspace(11, 'meshgrid');
Hd = zeros(11);
Hd(sqrt(f1.^2 + f2.^2) < 0.5) = 1;
h = fsamp2(Hd);

%κληση της freqfilt για φιλτραρισμα με τα παραπανω φιλτρα
G = freqfilt(N,g);
S = freqfilt(N,h);

%υπολογισμος των τριων σηματοθορυβικων λογων
SNR_0 = snr(I,N);
SNR_G = snr(I,G);
SNR_S = snr(I,S);


end

