function Q = quant_C(C, q)
%Η συναρτηση αυτη θα δεχεται ωε ορισμα τον DCT μετασχηματισμο Cb/Cr καναλιου 
%ενος block μεγεθους 8x8 και κατωφλιοποιεί επιλεκτικα κβαντίζοντας τις 
%επιλεγμένες τιμές σε ακέραιους αριθμούς και μηδενίζοντας τις υπόλοιπες. 

QfC = [ 17 18 24 47 99 99 99 99
        18 21 26 66 99 99 99 99
        24 26 56 99 99 99 99 99
        47 66 99 99 99 99 99 99
        99 99 99 99 99 99 99 99
        99 99 99 99 99 99 99 99
        99 99 99 99 99 99 99 99
        99 99 99 99 99 99 99 99 ];
    
QC = q * QfC;
Q = round(C ./ QC);

end

